test_config/cfe/InformationRegisters/AVS_СоставКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_СоставКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвязкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

test_config/cfe/Catalogs/AVS_КатегорииНоменклатурыСайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_КатегорииНоменклатурыСайт</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеРеквизитыИСведения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипЗначенияХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипЗначенияХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВариантыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ГруппаХарактеристик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипСвязки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипСвязки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/AVS_МедиаФайлыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_МедиаФайлыТоваров</Name>
			<Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
			</Type>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипМедиа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипыМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/CommonModules/AVS_ВыгрузкаНаСайт/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует JSON категорий
Функция ВыгрузитьКатегории(МассивКатегорий = Неопределено) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Категории.Ссылка КАК Ссылка,
    |   Категории.Наименование КАК Наименование,
    |   Категории.Родитель КАК Родитель,
    |   Категории.СсылкаНаИзображение КАК СсылкаНаИзображение,
    |   Категории.ПорядокСортировки КАК ПорядокСортировки
    |ИЗ
    |   Справочник.AVS_КатегорииНоменклатурыСайт КАК Категории
    |ГДЕ
    |   НЕ Категории.ПометкаУдаления
    |   И (&ВсеКатегории ИЛИ Категории.Ссылка В (&МассивКатегорий))";
    
    Запрос.УстановитьПараметр("ВсеКатегории", МассивКатегорий = Неопределено);
    Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
    
    Результат = Запрос.Выполнить().Выбрать();
    
    МассивКатегорийJSON = Новый Массив;
    
    Пока Результат.Следующий() Цикл
        СтруктураКатегории = Новый Структура;
		// { ПРАВКА: Используем конвертер для ID }
		
		СтруктураКатегории.Вставить("id", AVS_ПреобразоватьЗначениеДляJSON(Результат.Ссылка));
        СтруктураКатегории.Вставить("name", Результат.Наименование);
        СтруктураКатегории.Вставить("parent_id", AVS_ПреобразоватьЗначениеДляJSON(Результат.Родитель));
		// { ПРАВКА_КОНЕЦ }
		
        
        СтруктураКатегории.Вставить("image_url", Результат.СсылкаНаИзображение);
        СтруктураКатегории.Вставить("sort", Результат.ПорядокСортировки);
        
        // Получаем характеристики категории
        СтруктураКатегории.Вставить("features_id", AVS_ПолучитьХарактеристикиКатегории(Результат.Ссылка));
        
        МассивКатегорийJSON.Добавить(СтруктураКатегории);
    КонецЦикла;
    
    // Используем стандартный объект JSON
    Возврат СформироватьJSONСтроку(МассивКатегорийJSON);
    
КонецФункции

// Формирует JSON товаров с учетом связок
Функция AVS_ВыгрузитьТовары(МассивТоваров = Неопределено) Экспорт
    
    Попытка
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   СпрНоменклатура.Ссылка КАК Ссылка,
        |   СпрНоменклатура.Наименование КАК Наименование,
        |   СпрНоменклатура.Артикул КАК Артикул,
        |   ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Штрихкод
        |ИЗ
        |   Справочник.Номенклатура КАК СпрНоменклатура
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
        |       ПО СпрНоменклатура.Ссылка = Состав.Номенклатура
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
        |       ПО СпрНоменклатура.Ссылка = Штрихкоды.Номенклатура
        |ГДЕ
        |   НЕ СпрНоменклатура.ПометкаУдаления
        |   И Состав.СвязкаАктивна = ИСТИНА
        |   И (&ВсеТовары ИЛИ СпрНоменклатура.Ссылка В (&МассивТоваров))";
        
        Запрос.УстановитьПараметр("ВсеТовары", МассивТоваров = Неопределено);
        Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
        
        Выборка = Запрос.Выполнить().Выбрать();
        МассивТоваровJSON = Новый Массив;
        
        Пока Выборка.Следующий() Цикл
            СтруктураТовара = Новый Структура;
            СтруктураТовара.Вставить("id",          AVS_ПреобразоватьЗначениеДляJSON(Выборка.Ссылка));
            СтруктураТовара.Вставить("name",        Выборка.Наименование);
            СтруктураТовара.Вставить("code_number", Выборка.Артикул);
            СтруктураТовара.Вставить("barcode",     Выборка.Штрихкод);
            
            // variant_id — это GUID связки согласно ТЗ 2.1
            Связка = AVS_ОбщийМодульСайт.ПолучитьИдентификаторСвязкиТовара(Выборка.Ссылка);
            СтруктураТовара.Вставить("variant_id",  AVS_ПреобразоватьЗначениеДляJSON(Связка));
            СтруктураТовара.Вставить("categories_id", AVS_ПолучитьКатегорииТовара(Выборка.Ссылка));
            СтруктураТовара.Вставить("media", AVS_ПолучитьМедиаТовара(Выборка.Ссылка));
			
			МассивТоваровJSON.Добавить(СтруктураТовара);
        КонецЦикла;
        
        Возврат СформироватьJSONСтроку(МассивТоваровJSON);
    Исключение
        Сообщить("[AVS ERROR]: Ошибка в AVS_ВыгрузитьТовары: " + ОписаниеОшибки());
        Возврат "[]";
    КонецПопытки;
КонецФункции

// Формирует JSON для переданного массива связок (Bundle)
Функция AVS_ВыгрузитьСвязкиПоСписку(МассивСвязок) Экспорт
    
    Если МассивСвязок = Неопределено Или МассивСвязок.Количество() = 0 Тогда
        Возврат "[]";
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Спр.Ссылка КАК Ссылка,
    |	Спр.Наименование КАК name
    |ИЗ
    |	Справочник.AVS_ИдентификаторыСвязок КАК Спр
    |ГДЕ
    |	Спр.Ссылка В (&МассивСвязок)";
    
    Запрос.УстановитьПараметр("МассивСвязок", МассивСвязок);
    Выборка = Запрос.Выполнить().Выбрать();
    
    МассивСвязокJSON = Новый Массив;
    Пока Выборка.Следующий() Цикл
        
        СтруктураСвязки = Новый Структура;
        СтруктураСвязки.Вставить("id_svyazka", AVS_ПреобразоватьЗначениеДляJSON(Выборка.Ссылка));
        СтруктураСвязки.Вставить("name",       ?(ПустаяСтрока(Выборка.name), "Связка товаров", Выборка.name));
        
        // Получаем массив GUID характеристик (features) с учетом порядка
        ЗапросХар = Новый Запрос(
            "ВЫБРАТЬ Характеристика КАК Свойство 
            |ИЗ РегистрСведений.AVS_ХарактеристикиСвязок 
            |ГДЕ Связка = &Связка УПОРЯДОЧИТЬ ПО Порядок");
        ЗапросХар.УстановитьПараметр("Связка", Выборка.Ссылка);
        ВыборкаХар = ЗапросХар.Выполнить().Выбрать();
        
        МассивGUID = Новый Массив;
        Пока ВыборкаХар.Следующий() Цикл
            МассивGUID.Добавить(AVS_ПреобразоватьЗначениеДляJSON(ВыборкаХар.Свойство));
        КонецЦикла;
        
        СтруктураСвязки.Вставить("features", МассивGUID);
        МассивСвязокJSON.Добавить(СтруктураСвязки);
    КонецЦикла;
    
    Возврат СформироватьJSONСтроку(МассивСвязокJSON);
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает характеристики категории
Функция AVS_ПолучитьХарактеристикиКатегории(Категория) Экспорт
    
    МассивКатегорий = AVS_ПолучитьМассивРодителей(Категория);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Таб.Свойство КАК Свойство,
    |	МИНИМУМ(Таб.ПорядокСортировки) КАК Порядок
    |ИЗ
    |	РегистрСведений.AVS_ХарактеристикиКатегорий КАК Таб
    |ГДЕ
    |	Таб.Категория В (&МассивКатегорий)
    |СГРУППИРОВАТЬ ПО
    |	Таб.Свойство
    |УПОРЯДОЧИТЬ ПО
    |	Порядок";
    
    Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
    
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
    МассивGUID = Новый Массив;
    
    Пока РезультатЗапроса.Следующий() Цикл
        // Используем наш конвертер, чтобы получить чистый GUID строкой
        МассивGUID.Добавить(AVS_ПреобразоватьЗначениеДляJSON(РезультатЗапроса.Свойство));
    КонецЦикла;
    
    Возврат МассивGUID;
    
КонецФункции

Функция AVS_ПолучитьМассивРодителей(Категория) Экспорт
    Массив = Новый Массив;
    Массив.Добавить(Категория);
    
    Родитель = Категория.Родитель;
    Пока ЗначениеЗаполнено(Родитель) Цикл
        Массив.Добавить(Родитель);
        Родитель = Родитель.Родитель;
    КонецЦикла;
    
    Возврат Массив;
КонецФункции


// Получает категории товара
Функция AVS_ПолучитьКатегорииТовара(Товар)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Состав.Категория КАК Категория
    |ИЗ
    |   РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
    |ГДЕ
    |   Состав.Номенклатура = &Товар
    |   И Состав.СвязкаАктивна = ИСТИНА";
    
    Запрос.УстановитьПараметр("Товар", Товар);
    Результат = Запрос.Выполнить().Выгрузить();
    
    МассивGUID = Новый Массив;
    Для Каждого Строка Из Результат Цикл
    // Конвертер обеспечит возврат строки GUID без риска ошибки "Объект не найден"
    МассивGUID.Добавить(AVS_ПреобразоватьЗначениеДляJSON(Строка.Категория));
КонецЦикла;
    
    Возврат МассивGUID;
    
КонецФункции

// Получает характеристики товара с учетом связок
Функция AVS_ПолучитьХарактеристикиТовара(Товар)
	
	// --- 1. ПРОВЕРКА ВХОДНЫХ ДАННЫХ ---
	Если ТипЗнч(Товар) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Товар) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Попытка
		Сообщить("[AVS DEBUG]: Сбор характеристик для товара: " + Строка(Товар));
		
		// --- 2. СБОР ВСЕХ КАТЕГОРИЙ ТОВАРА И ИХ РОДИТЕЛЕЙ (НАСЛЕДОВАНИЕ) ---
		ЗапросКат = Новый Запрос;
		ЗапросКат.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Состав.Категория КАК Категория
			|ИЗ
			|	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
			|ГДЕ
			|	Состав.Номенклатура = &Товар
			|	И Состав.СвязкаАктивна = ИСТИНА";
		ЗапросКат.УстановитьПараметр("Товар", Товар);
		
		ВыгрузкаКат = ЗапросКат.Выполнить().Выгрузить();
		МассивВсехКатегорий = Новый Массив;
		
		Для Каждого СтрКат Из ВыгрузкаКат Цикл
			// Получаем всю цепочку родителей для каждой категории товара
			Родители = AVS_ПолучитьМассивРодителей(СтрКат.Категория);
			Для Каждого Род Из Родители Цикл
				Если МассивВсехКатегорий.Найти(Род) = Неопределено Тогда
					МассивВсехКатегорий.Добавить(Род);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если МассивВсехКатегорий.Количество() = 0 Тогда
			Сообщить("[AVS DEBUG]: Товар не привязан к категориям сайта. Характеристики не выгружаются.");
			Возврат Новый Массив;
		КонецЕсли;

		// --- 3. ПОЛУЧЕНИЕ "БЕЛОГО СПИСКА" РАЗРЕШЕННЫХ ХАРАКТЕРИСТИК ---
		ЗапросРазрешенные = Новый Запрос;
		ЗапросРазрешенные.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ХарКат.Свойство КАК Свойство
			|ИЗ
			|	РегистрСведений.AVS_ХарактеристикиКатегорий КАК ХарКат
			|ГДЕ
			|	ХарКат.Категория В (&МассивКатегорий)";
		ЗапросРазрешенные.УстановитьПараметр("МассивКатегорий", МассивВсехКатегорий);
		
		МассивРазрешенных = ЗапросРазрешенные.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");
		
		Если МассивРазрешенных.Количество() = 0 Тогда
			Сообщить("[AVS DEBUG]: В категориях товара не настроены разрешенные характеристики.");
			Возврат Новый Массив;
		КонецЕсли;

		// --- 4. ПОЛУЧЕНИЕ ЗНАЧЕНИЙ ХАРАКТЕРИСТИК ТОВАРА ---
		ЗапросЗначения = Новый Запрос;
		ЗапросЗначения.Текст = 
			"ВЫБРАТЬ
			|	ДопСведения.Свойство КАК Свойство,
			|	ДопСведения.Значение КАК Значение,
			|	Свойства.AVS_ТипЗначенияХарактеристики КАК ТипЗначения,
			|	Свойства.AVS_ТипСвязки КАК ТипСвязки
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДопСведения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Свойства
			|		ПО ДопСведения.Свойство = Свойства.Ссылка
			|ГДЕ
			|	ДопСведения.Объект = &Товар
			|	И ДопСведения.Свойство В (&МассивРазрешенных)
			|	И Свойства.AVS_ВыгружатьНаСайт = ИСТИНА";
		
		ЗапросЗначения.УстановитьПараметр("Товар", Товар);
		ЗапросЗначения.УстановитьПараметр("МассивРазрешенных", МассивРазрешенных);
		
		Выборка = ЗапросЗначения.Выполнить().Выбрать();
		МассивХарактеристикJSON = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураХар = Новый Структура;
			СтруктураХар.Вставить("feature_id", AVS_ПреобразоватьЗначениеДляJSON(Выборка.Свойство));
			
			// Определяем код типа для корректного формирования value (ТЗ 2.2)
			КодТипа = AVS_ПолучитьКодТипаНаСервере(Выборка.ТипЗначения);
			
			// А) Обработка Групповых связок (groupLink)
			Если Выборка.ТипСвязки = Перечисления.AVS_ТипСвязки.groupLink Тогда
				СтруктураХар.Вставить("value_type", "groupLink");
				СтруктураХар.Вставить("value",      AVS_ПолучитьДанныеСвязки(Товар, Выборка.Свойство));
			
			// Б) Обработка Множественного выбора (optionList)
			ИначеЕсли КодТипа = "optionList" Тогда
				МассивЗначений = Новый Массив;
				Если ЗначениеЗаполнено(Выборка.Значение) Тогда
					МассивЗначений.Добавить(AVS_ПреобразоватьЗначениеДляJSON(Выборка.Значение));
				КонецЕсли;
				СтруктураХар.Вставить("value", МассивЗначений);
			
			// В) Обычные значения (string, number, optionSingle)
			Иначе
				СтруктураХар.Вставить("value", AVS_ПреобразоватьЗначениеДляJSON(Выборка.Значение));
			КонецЕсли;
			
			МассивХарактеристикJSON.Добавить(СтруктураХар);
			
		КонецЦикла;
		
		Сообщить(СтрШаблон("[AVS DEBUG]: Собрано характеристик: %1 (из %2 разрешенных)", 
			МассивХарактеристикJSON.Количество(), МассивРазрешенных.Количество()));
			
		Возврат МассивХарактеристикJSON;

	Исключение
		ТекстОшибки = "[AVS ERROR]: Ошибка в AVS_ПолучитьХарактеристикиТовара: " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		AVS_Логирование.ЗаписатьВЛог(ТекстОшибки);
		Возврат Новый Массив;
	КонецПопытки;
	
    
КонецФункции

// Получает данные связки для groupLink
Функция AVS_ПолучитьДанныеСвязки(Товар, ХарактеристикаСвязки)
    
    // { ПРАВКА: Оптимизированный сбор данных без дублей и лишних соединений }
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Состав.Товар КАК linked_id,
    |    ПРЕДСТАВЛЕНИЕ(Состав.ЗначениеХарактеристики) КАК characteristic_value,
    |    Состав.Порядок КАК ПорядокСортировки
    |ИЗ
    |    РегистрСведений.AVS_СоставСвязокНоменклатуры КАК Состав
    |ГДЕ
    |    Состав.Связка В (ВЫБРАТЬ ПЕРВЫЕ 1 Связка ИЗ РегистрСведений.AVS_СоставСвязокНоменклатуры ГДЕ Товар = &Товар)
    |    И Состав.ХарактеристикаСвязки = &Характеристика
    |УПОРЯДОЧИТЬ ПО
    |    ПорядокСортировки";
    
    Запрос.УстановитьПараметр("Товар", Товар);
    Запрос.УстановитьПараметр("Характеристика", ХарактеристикаСвязки);
    
    МассивРезультатов = Новый Массив;
    
    Попытка
        Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
						
            СтруктураДанных = Новый Структура;
			
			// Типизированные данные для связки 
        СтруктураДанных.Вставить("linked_id", AVS_ПреобразоватьЗначениеДляJSON(Выборка.linked_id));
        
        // Для отображения в интерфейсе переключателя на сайте оставляем представление, 
        // так как пользователю нужно видеть "Красный", а не GUID.
        СтруктураДанных.Вставить("characteristic_value", Строка(Выборка.characteristic_value)); 
			
            МассивРезультатов.Добавить(СтруктураДанных);
        КонецЦикла;
    Исключение
        AVS_Логирование.ЗаписатьВЛог("Ошибка выгрузки связки для " + Строка(Товар) + ": " + ОписаниеОшибки());
    КонецПопытки;
    
    Возврат МассивРезультатов; 
КонецФункции

// Формирует JSON строку из структуры/массива (Универсальная функция)
Функция СформироватьJSONСтроку(Данные) Экспорт
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    
    НастройкиJSON = Новый НастройкиСериализацииJSON;
    НастройкиJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    НастройкиJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    
    ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиJSON);
    
    Возврат ЗаписьJSON.Закрыть();
    
КонецФункции

// Читает JSON строку в структуру/массив
Функция ПрочитатьJSONСтроку(СтрокаJSON) Экспорт
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    
    Данные = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();
    
    Возврат Данные;
    
КонецФункции

// { ПРАВКА_НАЧАЛО: Умный конвертер с поддержкой числовых характеристик и значений свойств }
Функция AVS_ПреобразоватьЗначениеДляJSON(Значение) Экспорт
	
	Если Значение = Неопределено Или Значение = NULL Тогда
        Возврат "";
    КонецЕсли;
    
    ТипЗнч = ТипЗнч(Значение);
    
    // 1. Ссылочные типы -> GUID строкой (ТЗ 4.1)
    Попытка
        Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч) Тогда
            // Для перечислений возвращаем имя (INSERT, UPDATE и т.д.)
            Возврат Значение.Метаданные().Имя;
        ИначеЕсли Значение.Пустая() Тогда
            Возврат "";
        КонецЕсли;
        
        // Справочники, ПВХ и т.д.
        Возврат Строка(Значение.УникальныйИдентификатор());
    Исключение
        // Не ссылочный тип
    КонецПопытки;
    
    // 2. Примитивные типы (Number, Boolean сохраняем как есть для JSON)
    Если ТипЗнч = Тип("Число") Или ТипЗнч = Тип("Булево") Тогда
        Возврат Значение;
    КонецЕсли;
    
    // 3. Дата -> ISO
    Если ТипЗнч = Тип("Дата") Тогда
        Возврат Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss");
    КонецЕсли;
    
    // 4. Остальное -> Строка
    Возврат СокрЛП(Строка(Значение));
	
КонецФункции
// { ПРАВКА_КОНЕЦ }  

// { ДОБАВЛЕНО: Вспомогательная функция для определения типа }
Функция AVS_ПолучитьКодТипаНаСервере(ЗначениеТипа) Экспорт
    
    Если Не ЗначениеЗаполнено(ЗначениеТипа) Тогда Возврат "string"; КонецЕсли;
    
    ИмяТипа = ВРег(Строка(ЗначениеТипа));
    
    Если Найти(ИмяТипа, "ГРУПП") > 0 Или Найти(ИмяТипа, "СВЯЗ") > 0 Тогда
        Возврат "groupLink";
    ИначеЕсли Найти(ИмяТипа, "МНОЖЕСТВ") > 0 Тогда
        Возврат "optionList";
    ИначеЕсли Найти(ИмяТипа, "ОДИНОЧН") > 0 Или Найти(ИмяТипа, "СПИСОК") > 0 Тогда
        Возврат "optionSingle";
    ИначеЕсли Найти(ИмяТипа, "ЧИСЛО") > 0 Тогда
        Возврат "number";
    ИначеЕсли Найти(ИмяТипа, "БУЛЕВО") > 0 Тогда
        Возврат "boolean";
    КонецЕсли;
    
    Возврат "string";
    
КонецФункции

// Получает список медиа-файлов товара для формирования JSON выгрузки (ТЗ №2)
Функция AVS_ПолучитьМедиаТовара(Товар) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Медиа.AVS_ТипМедиа КАК ТипМедиа,
    |	Медиа.AVS_URL КАК URL,
    |	Медиа.AVS_Сортировка КАК Сортировка
    |ИЗ
    |	ПланВидовХарактеристик.AVS_МедиаФайлыТоваров КАК Медиа
    |ГДЕ
    |	Медиа.AVS_Номенклатура = &Товар
    |	И НЕ Медиа.ПометкаУдаления
    |УПОРЯДОЧИТЬ ПО
    |	Медиа.AVS_Сортировка";
    
    Запрос.УстановитьПараметр("Товар", Товар);
    
    Выборка = Запрос.Выполнить().Выбрать();
    МассивМедиаJSON = Новый Массив;
    
    Пока Выборка.Следующий() Цикл
        
        СтруктураМедиа = Новый Структура;
        
        // Маппинг типов: Фото -> image, Видео -> video
		ТекТип = "image"; 
        Если Выборка.ТипМедиа = ПредопределенноеЗначение("Перечисление.AVS_ТипыМедиа.Видео") Тогда
            ТекТип = "video";
        КонецЕсли;
        
        СтруктураМедиа.Вставить("type", ТекТип);
        СтруктураМедиа.Вставить("url",  Выборка.URL);
        СтруктураМедиа.Вставить("sort", Строка(Выборка.Сортировка));
        
        МассивМедиаJSON.Добавить(СтруктураМедиа);
        
    КонецЦикла;
    
    Возврат МассивМедиаJSON;
    
КонецФункции

#КонецОбласти
